[
  {
    "title": "Software Developer at Encora Inc",
    "company": "Encora Inc",
    "url": "https://www.encora.com",
    "timeline": "May 2025 - Oct 2025",
    "industry": "Accelerators, Data and GenAI",
    "description": "Working at internal projects for Data and GenAI as accelerators and improving processes for Talent Acquisition (Android and Java/Kotlin Backend)."
  }, 
  {
    "title": "Client Director and Engineering Manager at Encora Inc",
    "company": "Encora Inc",
    "url": "https://www.encora.com",
    "timeline": "Mar 2022 - Apr 2025",
    "industry": "Government, Education, Healthcare, Transportation, Travel",
    "description": "I coached and managed 56 engineers across the USA, Mexico, Argentina, Costa Rica, Colombia, and India while overseeing 17 client accounts in industries such as logistics, travel, healthcare, education, and energy. My role included facilitating kickoff meetings, defining expectations, and drafting contracts (SOW, MSA, EAF), as well as implementing performance improvement programs, onboarding/offboarding processes, and regular team health checks. I conducted weekly and biweekly meetings, one-on-one sessions for workload and wellbeing, performance and salary reviews, and ensured financial health within accounts. Additionally, I supported talent delivery, assigned roles, coordinated travel, presented Encora’s capabilities in Gen AI, Cloud, and Data, created fiscal reports and industry updates, interviewed candidates, designed challenges for the Spark Internship Program, mentored developers on the bench, and managed internal products and accelerators."
  },
  {
    "title": "Android Developer at Crew App",
    "company": "Crew App",
    "url": "https://www.crewapp.com",
    "timeline": "Nov 2018 - Mar 2022",
    "industry": "Communication, Restaurants",
    "description": "I designed and executed strategies to modernize legacy code by migrating from Java to Kotlin, while creating proof-of-concepts with Coroutines to enable new implementations. My work focused on continuous performance improvements, defining and documenting best practices and coding standards, and delivering demos of new features. Additionally, I established clear technical documentation in Confluence to support knowledge sharing and team alignment."
  },
  {
    "title": "Android Developer at Harvestmark",
    "company": "Harvestmark (now iFoods DS)",
    "url": "https://www.ifoodds.com/software-solutions/food-traceability-software/",
    "timeline": "Feb 2015 - Nov 2018",
    "industry": "Food and Transportation",
    "description": "Industry: Food and Transportation. Created and implemented a strategy to update all the legacy code from Eclipse version to Android Studio, Java to Kotlin and AsyncTasks to RxJava. Also created a version for China Territory"
  },
  {
    "title": "Full-stack Developer at Switchfly Inc",
    "company": "Switchfly Inc",
    "url": "https://www.switchfly.com",
    "timeline": "Jan 2014 - Feb 2015",
    "industry": "Travel and Hospitality",
    "description": "Industry: Travel and Hospitality. Integrated services from different vendors for hotels, activities and cruisers for Disney and Tam Viagens."
  },
  {
    "title": "Lead Developer and Project Manager at Ondore",
    "company": "Ondore Inc",
    "url": "https://www.linkedin.com/company/ondore",
    "timeline": "Jan 2013 - Dec 2013",
    "industry": "Social Media and Data Science",
    "description": "Worked with different teams as scrum master and project manager to deliver software solutions in two projects: Ondore Scout to monitor social media and internal product to train and monitor data algorithms"
  },
  {
    "title": "Lead Developer at Movistar",
    "company": "Movistar (as contractor for Ondore Inc)",
    "url": "https://hispam.wayra.com/",
    "timeline": "Jun 2012 - Dec 2012",
    "industry": "Healthcare",
    "description": "Industry: Healthcare. Implemented a Web application to store med data and history providing a platform for doctors and patients to access their information. Technologies: Java, JSP, Servlets, JDBC, HTML, CSS, JavaScript, MySQL."
  },
  {
    "title": "Fullstack Developer at Ondore",
    "company": "Ondore Inc",
    "url": "https://www.linkedin.com/company/ondore",
    "timeline": "Jan 2008 - Jun 2012",
    "industry": "Government, Education, Music",
    "description": "Industries: Government, Education, Music. Designed and developed backend applications to easy integrate in search engines for the government of Mexico, Universidad de Colima, Ideas Radio Telcel. Implemented data strategies to index and consolidate sources for data search engines. Implemented the web crawlers agents to retrieve the information from diffferent media"
  },
  {
    "title": "Intern Fullstack Developer at Universidad Nacional Autónoma de México",
    "company": "Universidad Nacional Autónoma de México",
    "url": "https://www.unam.mx",
    "timeline": "Jan 2007 - Dec 2007",
    "industry": "Education",
    "description": "Industry Education: Assisted in the development and testing of web applications, gaining practical experience in software development. Worked in ALUNAM Project to provide online educational services to students."
  }

]
