[
  {
    "title": "Software Developer at Encora Inc",
    "company": "Encora",
    "url": "https://www.encora.com",
    "timeline": "May 2025 - Oct 2025",
    "description": "Working at internal projects for Data and GenAI as accelerators and improving processes for Talent Acquisition (Android and Java/Kotlin Backend)."
  }, 
  {
    "title": "Client Director and Engineering Manager at Encora Inc",
    "company": "Encora",
    "url": "https://www.encora.com",
    "timeline": "Mar 2022 - Apr 2025",
    "description": "Coaching 56 engineers from USA, Mexico, Argentina, Costa Rica, Colombia, and India. Management of 17 accounts in Logistics, Travel, Healthcare, Last Mile Delivery, Education, Energy, among others."
  },
  {
    "title": "Android Developer at Crew App",
    "company": "Crew App",
    "url": "https://www.crewapp.com",
    "timeline": "Nov 2018 - Mar 2022",
    "description": "Created and implemented strategies to update legacy code from Java to Kotlin. Worked on new features for companies such as Mondelez and Grupo Bimbo"
  },
  {
    "title": "Android Developer at Harvestmark",
    "company": "Harvestmark (now iFoods DS)",
    "url": "https://www.ifoodds.com/software-solutions/food-traceability-software/",
    "timeline": "Feb 2015 - Nov 2018",
    "description": "Created and implemented a strategy to update all the legacy code from Eclipse version to Android Studio, Java to Kotlin and AsyncTasks to RxJava. Also created a version for China Territory"
  },
  {
    "title": "Full-stack Developer at Switchfly Inc",
    "company": "Switchfly Inc",
    "url": "https://www.switchfly.com",
    "timeline": "Jan 2014 - Feb 2015",
    "description": "ntegrated services from different vendors for hotels, activities and cruisers for Disney and Tam Viagens."
  },
  {
    "title": "Lead Developer and Project Manager at Ondore",
    "company": "Ondore Inc",
    "url": "https://www.linkedin.com/company/ondore",
    "timeline": "Jan 2013 - Dec 2013",
    "description": "Assisted in the development and testing of Android applications, gaining practical experience in mobile app development."
  },
  {
    "title": "Lead Developer at Movistar",
    "company": "Movistar (as contractor for Ondore Inc)",
    "url": "https://hispam.wayra.com/",
    "timeline": "Jun 2012 - Dec 2012",
    "description": "Industry: Healthcare. Implemented a Web application to store med data and history providing a platform for doctors and patients to access their information. Technologies: Java, JSP, Servlets, JDBC, HTML, CSS, JavaScript, MySQL."
  },
  {
    "title": "Fullstack Developer at Ondore",
    "company": "Ondore Inc",
    "url": "https://www.linkedin.com/company/ondore",
    "timeline": "Jan 2008 - Jun 2012",
    "description": "Industries: Government, Education, Music. Designed and developed backend applications to easy integrate in search engines for the government of Mexico, Universidad de Colima, Ideas Radio Telcel. Implemented data strategies to index and consolidate sources for data search engines. Implemented the web crawlers agents to retrieve the information from diffferent media"
  },
  {
    "title": "Intern Fullstack Developer at Universidad Nacional Autónoma de México",
    "company": "Universidad Nacional Autónoma de México",
    "url": "https://www.unam.mx",
    "timeline": "Jan 2007 - Dec 2007",
    "description": "Industry Education: Assisted in the development and testing of web applications, gaining practical experience in software development. Worked in ALUNAM Project to provide online educational services to students."
  }

]
