[
  {
    "title": "Library Review: ShowCaseView for Android",
    "url": "https://medium.com/@saishaddai/library-review-showcaseview-for-android-dde60c25294c",
    "date": "Mar 02, 2020",
    "media": "At Medium",
    "description": "ShowcaseView is a library to create targeted prompts to show little explanations given a coordinated position in the screen. It is limited in customization in order to improve its easiness to implement."
  }, 
  {
    "title": "Library Review: Material Tap Target Prompt for Android",
    "url": "https://medium.com/@saishaddai/library-review-material-tap-target-prompt-for-android-69171c9f95d8",
    "date": "Feb 24, 2020",
    "media": "At Medium",
    "description": "Material Tap Target Prompt allows you to see create targeted prompts to show little explanations of certain visible items in the screen. It also allows some customization such as background, font colors and gravity of the texts."
  },
  {
    "title": "Plurals in Kotlin without 3rd party libraries",
    "url": "https://medium.com/@saishaddai/how-to-know-when-a-device-is-ringing-in-android-57e516d0ab42",
    "date": "Feb 18, 2020",
    "media": "At Medium",
    "description": "Singular/Plural text is a very common problem in programming since the first days of GUI's. Reason is that it is an unforgiven grammatical error to say “1 items in stock” instead of “1 item in stock”. In this post I'll bring different approaches to fix this."
  },
  {
    "title": "How to know when a device is ringing in Android?",
    "url": "https://medium.com/@saishaddai/how-to-know-when-a-device-is-ringing-in-android-57e516d0ab42",
    "date": "Jan 13, 2020",
    "media": "At Medium",
    "description": "Maybe a very basic question but I implemented a quick way to catch when the user's device is ringing. This solution includes Broadcasts and TelephonyManager’s states"
  }, 
  {
    "title": "How to recognize when the user is not moving in Android?",
    "url": "https://medium.com/@saishaddai/how-to-recognize-when-the-user-is-not-moving-in-android-be6dba7a90bb",
    "date": "Jan 06, 2020",
    "media": "At Medium",
    "description": "Activity Recognition is an API that help us know if a user is in movement or standing still. In this post I'll share an idea that you can implement in your projects that may avoid accidents in the real life."
  },
  {
    "title": "How to make clickable a part of a text in Android?",
    "url": "https://medium.com/@saishaddai/how-to-make-clickable-a-part-of-a-text-in-android-d1a342726995",
    "date": "Dec 23, 2019",
    "media": "At Medium",
    "description": "Clickable links are a very common technique used in HTML to send to further information (as you can see at the end in any of my posts). Even so, this is very uncommon in mobile development."
  }, 
  {
    "title": "Mobile Painter's Algorithm",
    "url": "https://medium.com/@saishaddai/how-to-create-a-simple-notification-in-android-6e2f3f3f5f8e",
    "date": "Dec 16, 2019",
    "media": "At Medium",
    "description": "The Algorithm that Android uses to know which UI elements to show in a screen and how it decides which elements should be closer to the user's view."
  }, 
  {
    "title": "Overdraw in Android",
    "url": "https://medium.com/@saishaddai/overdraw-in-android-67141bd75717",
    "date": "Dec 09, 2019",
    "media": "At Medium",
    "description": "While debugging an old app I wrote a couple of years ago, I found that I was wasting a significant amount of GPU with no explanation. In this post, I'll try to explain what Overdraw is and how you can detect if your app is having this problem."
  }, 
  {
    "title": "Shallow, Deep and Defensive copies",
    "url": "https://medium.com/@saishaddai/shallow-deep-and-defensive-copies-a7854227f5d6",
    "date": "Dec 05, 2019",
    "media": "At Medium",
    "description": "Shallow and Deep copies are very basic definitions used in programming languages such as C and C++. It might be a little bit confusing if your dominant programming language is Java. In this post, I’m going to review this definitions with an approach to Java programming language."
  }, 
  {
    "title": "How to know when you’re using dark mode programmatically?",
    "url": "https://medium.com/@saishaddai/how-to-know-when-youre-using-dark-mode-programmatically-9be83fded4b0",
    "date": "Nov 25, 2019",
    "media": "At Medium",
    "description": "With the new addition to dark mode in Android, I've been updating my old projects to allow the dark mode to be used when possible…"
  },
  {
    "title": "Android: What is Moshi?",
    "url": "https://medium.com/@saishaddai/android-what-is-moshi-36798fc2ee0c",
    "date": "Oct 22, 2019",
    "media": "At Medium",
    "description": "By client's request, I recently started to try a different third party library to replace Gson: Moshi. Here my first impressions of this…"
  }, 
  {
    "title": "Last 30 days registers query in SQLite",
    "url": "https://medium.com/@saishaddai/last-30-days-registers-query-in-sqlite-c9ef66810c86",
    "date": "Oct 14, 2019",
    "media": "At Medium",
    "description": "This is one of the most common queries you actually run for different features in your project but it actually differs from one database…"
  },
  {
    "title": "How does it work the predictive text in smart phones?",
    "url": "https://medium.com/@saishaddai/how-does-it-work-the-predictive-text-in-smart-phones-8fb631e4e3a6",
    "date": "Sep 23, 2019",
    "media": "At Medium",
    "description": "There are small things in our daily basis that might be unnoticed until someone else ask “how does it work?” Well, in this post let me share with you a very used algorithm in smart phones to predict your words while you’re texting."
  }
]
